; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f4-c8-s4-i8-010-110-210-310
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10
 - card
          celln0 celln1 celln2 celln3 celln4 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln4)
(colspace coln0)

(bottomcol c1)
(on s3 c1)
(on d3 s3)
(on s9 d3)
(clear s9)

(bottomcol s8)
(on d4 s8)
(on s6 d4)
(clear s6)

(bottomcol d7)
(on c9 d7)
(on h4 c9)
(on d8 h4)
(on d2 d8)
(on c7 d2)
(on c5 c7)
(on h6 c5)
(on d1 h6)
(clear d1)

(bottomcol d6)
(on c10 d6)
(on s10 c10)
(on c2 s10)
(on h5 c2)
(on h3 h5)
(clear h3)

(bottomcol s2)
(on c6 s2)
(on h1 c6)
(on h8 h1)
(on c4 h8)
(clear c4)

(bottomcol s1)
(on s4 s1)
(on d9 s4)
(clear d9)

(bottomcol h7)
(on s7 h7)
(on c8 s7)
(on d10 c8)
(clear d10)

(bottomcol h9)
(on d5 h9)
(on h2 d5)
(on h10 h2)
(on c3 h10)
(on s5 c3)
(clear s5)
)
(:goal
(and
(home c10)
(home h10)
(home s10)
(home d10)
)
)
)

; plan
1. (sendtohome d1 h6 d n1 d0 n0)
   deleted: (on d1 h6) (home d0) (clear d1)
   added: (home d1) (clear h6)
   goals met: 0 of 4
2. (sendtofree d9 s4 celln4 celln3)
   deleted: (on d9 s4) (clear d9) (cellspace celln4)
   added: (incell d9) (clear s4) (cellspace celln3)
   goals met: 0 of 4
3. (sendtofree s4 s1 celln3 celln2)
   deleted: (on s4 s1) (clear s4) (cellspace celln3)
   added: (incell s4) (clear s1) (cellspace celln2)
   goals met: 0 of 4
4. (sendtohome-b s1 s n1 s0 n0 coln0 coln1)
   deleted: (home s0) (clear s1) (bottomcol s1) (colspace coln0)
   added: (home s1) (colspace coln1)
   goals met: 0 of 4
5. (sendtofree c4 h8 celln2 celln1)
   deleted: (on c4 h8) (clear c4) (cellspace celln2)
   added: (incell c4) (clear h8) (cellspace celln1)
   goals met: 0 of 4
6. (sendtofree h3 h5 celln1 celln0)
   deleted: (on h3 h5) (clear h3) (cellspace celln1)
   added: (incell h3) (clear h5) (cellspace celln0)
   goals met: 0 of 4
7. (sendtonewcol s6 d4 coln1 coln0)
   deleted: (on s6 d4) (colspace coln1)
   added: (bottomcol s6) (clear d4) (colspace coln0)
   goals met: 0 of 4
8. (move h5 c2 s6)
   deleted: (on h5 c2) (clear s6)
   added: (on h5 s6) (clear c2)
   goals met: 0 of 4
9. (move h8 h1 s9)
   deleted: (on h8 h1) (clear s9)
   added: (on h8 s9) (clear h1)
   goals met: 0 of 4
10. (sendtohome h1 c6 h n1 h0 n0)
   deleted: (on h1 c6) (home h0) (clear h1)
   added: (home h1) (clear c6)
   goals met: 0 of 4
11. (colfromfreecell c4 h5 celln0 celln1)
   deleted: (incell c4) (cellspace celln0) (clear h5)
   added: (cellspace celln1) (clear c4) (on c4 h5)
   goals met: 0 of 4
12. (sendtofree c6 s2 celln1 celln0)
   deleted: (on c6 s2) (clear c6) (cellspace celln1)
   added: (incell c6) (clear s2) (cellspace celln0)
   goals met: 0 of 4
13. (sendtohome-b s2 s n2 s1 n1 coln0 coln1)
   deleted: (home s1) (clear s2) (bottomcol s2) (colspace coln0)
   added: (home s2) (colspace coln1)
   goals met: 0 of 4
14. (sendtonewcol c2 s10 coln1 coln0)
   deleted: (on c2 s10) (colspace coln1)
   added: (bottomcol c2) (clear s10) (colspace coln0)
   goals met: 0 of 4
15. (move s5 c3 h6)
   deleted: (on s5 c3) (clear h6)
   added: (on s5 h6) (clear c3)
   goals met: 0 of 4
16. (move d4 s8 s5)
   deleted: (on d4 s8) (clear s5)
   added: (on d4 s5) (clear s8)
   goals met: 0 of 4
17. (move c3 h10 d4)
   deleted: (on c3 h10) (clear d4)
   added: (on c3 d4) (clear h10)
   goals met: 0 of 4
18. (colfromfreecell d9 s10 celln0 celln1)
   deleted: (incell d9) (cellspace celln0) (clear s10)
   added: (cellspace celln1) (clear d9) (on d9 s10)
   goals met: 0 of 4
19. (sendtofree h10 h2 celln1 celln0)
   deleted: (on h10 h2) (clear h10) (cellspace celln1)
   added: (incell h10) (clear h2) (cellspace celln0)
   goals met: 0 of 4
20. (sendtohome h2 d5 h n2 h1 n1)
   deleted: (on h2 d5) (home h1) (clear h2)
   added: (home h2) (clear d5)
   goals met: 0 of 4
21. (homefromfreecell h3 h n3 h2 n2 celln0 celln1)
   deleted: (incell h3) (cellspace celln0) (home h2)
   added: (home h3) (cellspace celln1)
   goals met: 0 of 4
22. (sendtofree d5 h9 celln1 celln0)
   deleted: (on d5 h9) (clear d5) (cellspace celln1)
   added: (incell d5) (clear h9) (cellspace celln0)
   goals met: 0 of 4
23. (move-b s8 d9 coln0 coln1)
   deleted: (bottomcol s8) (clear d9) (colspace coln0)
   added: (on s8 d9) (colspace coln1)
   goals met: 0 of 4
24. (sendtonewcol h8 s9 coln1 coln0)
   deleted: (on h8 s9) (colspace coln1)
   added: (bottomcol h8) (clear s9) (colspace coln0)
   goals met: 0 of 4
25. (move s9 d3 d10)
   deleted: (on s9 d3) (clear d10)
   added: (on s9 d10) (clear d3)
   goals met: 0 of 4
26. (move d3 s3 c4)
   deleted: (on d3 s3) (clear c4)
   added: (on d3 c4) (clear s3)
   goals met: 0 of 4
27. (sendtohome s3 c1 s n3 s2 n2)
   deleted: (on s3 c1) (home s2) (clear s3)
   added: (home s3) (clear c1)
   goals met: 0 of 4
28. (sendtohome-b c1 c n1 c0 n0 coln0 coln1)
   deleted: (home c0) (clear c1) (bottomcol c1) (colspace coln0)
   added: (home c1) (colspace coln1)
   goals met: 0 of 4
29. (sendtohome-b c2 c n2 c1 n1 coln1 coln2)
   deleted: (home c1) (clear c2) (bottomcol c2) (colspace coln1)
   added: (home c2) (colspace coln2)
   goals met: 0 of 4
30. (sendtohome c3 d4 c n3 c2 n2)
   deleted: (on c3 d4) (home c2) (clear c3)
   added: (home c3) (clear d4)
   goals met: 0 of 4
31. (homefromfreecell s4 s n4 s3 n3 celln0 celln1)
   deleted: (incell s4) (cellspace celln0) (home s3)
   added: (home s4) (cellspace celln1)
   goals met: 0 of 4
32. (sendtofree d3 c4 celln1 celln0)
   deleted: (on d3 c4) (clear d3) (cellspace celln1)
   added: (incell d3) (clear c4) (cellspace celln0)
   goals met: 0 of 4
33. (sendtohome c4 h5 c n4 c3 n3)
   deleted: (on c4 h5) (home c3) (clear c4)
   added: (home c4) (clear h5)
   goals met: 0 of 4
34. (sendtonewcol h5 s6 coln2 coln1)
   deleted: (on h5 s6) (colspace coln2)
   added: (bottomcol h5) (clear s6) (colspace coln1)
   goals met: 0 of 4
35. (sendtonewcol s9 d10 coln1 coln0)
   deleted: (on s9 d10) (colspace coln1)
   added: (bottomcol s9) (clear d10) (colspace coln0)
   goals met: 0 of 4
36. (colfromfreecell d5 s6 celln0 celln1)
   deleted: (incell d5) (cellspace celln0) (clear s6)
   added: (cellspace celln1) (clear d5) (on d5 s6)
   goals met: 0 of 4
37. (sendtofree d10 c8 celln1 celln0)
   deleted: (on d10 c8) (clear d10) (cellspace celln1)
   added: (incell d10) (clear c8) (cellspace celln0)
   goals met: 0 of 4
38. (move c8 s7 h9)
   deleted: (on c8 s7) (clear h9)
   added: (on c8 h9) (clear s7)
   goals met: 0 of 4
39. (move s7 h7 h8)
   deleted: (on s7 h7) (clear h8)
   added: (on s7 h8) (clear h7)
   goals met: 0 of 4
40. (move-b h7 c8 coln0 coln1)
   deleted: (bottomcol h7) (clear c8) (colspace coln0)
   added: (on h7 c8) (colspace coln1)
   goals met: 0 of 4
41. (sendtonewcol d4 s5 coln1 coln0)
   deleted: (on d4 s5) (colspace coln1)
   added: (bottomcol d4) (clear s5) (colspace coln0)
   goals met: 0 of 4
42. (sendtohome s5 h6 s n5 s4 n4)
   deleted: (on s5 h6) (home s4) (clear s5)
   added: (home s5) (clear h6)
   goals met: 0 of 4
43. (move h6 c5 s7)
   deleted: (on h6 c5) (clear s7)
   added: (on h6 s7) (clear c5)
   goals met: 0 of 4
44. (sendtohome c5 c7 c n5 c4 n4)
   deleted: (on c5 c7) (home c4) (clear c5)
   added: (home c5) (clear c7)
   goals met: 0 of 4
45. (homefromfreecell c6 c n6 c5 n5 celln0 celln1)
   deleted: (incell c6) (cellspace celln0) (home c5)
   added: (home c6) (cellspace celln1)
   goals met: 0 of 4
46. (sendtohome c7 d2 c n7 c6 n6)
   deleted: (on c7 d2) (home c6) (clear c7)
   added: (home c7) (clear d2)
   goals met: 0 of 4
47. (sendtohome d2 d8 d n2 d1 n1)
   deleted: (on d2 d8) (home d1) (clear d2)
   added: (home d2) (clear d8)
   goals met: 0 of 4
48. (homefromfreecell d3 d n3 d2 n2 celln1 celln2)
   deleted: (incell d3) (cellspace celln1) (home d2)
   added: (home d3) (cellspace celln2)
   goals met: 0 of 4
49. (sendtohome-b d4 d n4 d3 n3 coln0 coln1)
   deleted: (home d3) (clear d4) (bottomcol d4) (colspace coln0)
   added: (home d4) (colspace coln1)
   goals met: 0 of 4
50. (move d8 h4 s9)
   deleted: (on d8 h4) (clear s9)
   added: (on d8 s9) (clear h4)
   goals met: 0 of 4
51. (sendtohome h4 c9 h n4 h3 n3)
   deleted: (on h4 c9) (home h3) (clear h4)
   added: (home h4) (clear c9)
   goals met: 0 of 4
52. (sendtohome-b h5 h n5 h4 n4 coln1 coln2)
   deleted: (home h4) (clear h5) (bottomcol h5) (colspace coln1)
   added: (home h5) (colspace coln2)
   goals met: 0 of 4
53. (sendtohome h6 s7 h n6 h5 n5)
   deleted: (on h6 s7) (home h5) (clear h6)
   added: (home h6) (clear s7)
   goals met: 0 of 4
54. (sendtohome d5 s6 d n5 d4 n4)
   deleted: (on d5 s6) (home d4) (clear d5)
   added: (home d5) (clear s6)
   goals met: 0 of 4
55. (sendtohome-b s6 s n6 s5 n5 coln2 coln3)
   deleted: (home s5) (clear s6) (bottomcol s6) (colspace coln2)
   added: (home s6) (colspace coln3)
   goals met: 0 of 4
56. (sendtohome s7 h8 s n7 s6 n6)
   deleted: (on s7 h8) (home s6) (clear s7)
   added: (home s7) (clear h8)
   goals met: 0 of 4
57. (sendtohome h7 c8 h n7 h6 n6)
   deleted: (on h7 c8) (home h6) (clear h7)
   added: (home h7) (clear c8)
   goals met: 0 of 4
58. (sendtohome-b h8 h n8 h7 n7 coln3 coln4)
   deleted: (home h7) (clear h8) (bottomcol h8) (colspace coln3)
   added: (home h8) (colspace coln4)
   goals met: 0 of 4
59. (sendtofree c9 d7 celln2 celln1)
   deleted: (on c9 d7) (clear c9) (cellspace celln2)
   added: (incell c9) (clear d7) (cellspace celln1)
   goals met: 0 of 4
60. (sendtohome s8 d9 s n8 s7 n7)
   deleted: (on s8 d9) (home s7) (clear s8)
   added: (home s8) (clear d9)
   goals met: 0 of 4
61. (sendtohome c8 h9 c n8 c7 n7)
   deleted: (on c8 h9) (home c7) (clear c8)
   added: (home c8) (clear h9)
   goals met: 0 of 4
62. (sendtohome-b h9 h n9 h8 n8 coln4 coln5)
   deleted: (home h8) (clear h9) (bottomcol h9) (colspace coln4)
   added: (home h9) (colspace coln5)
   goals met: 0 of 4
63. (homefromfreecell h10 h n10 h9 n9 celln1 celln2)
   deleted: (incell h10) (cellspace celln1) (home h9)
   added: (home h10) (cellspace celln2)
   goals met: 1 of 4
64. (homefromfreecell c9 c n9 c8 n8 celln2 celln3)
   deleted: (incell c9) (cellspace celln2) (home c8)
   added: (home c9) (cellspace celln3)
   goals met: 1 of 4
65. (sendtofree d9 s10 celln3 celln2)
   deleted: (on d9 s10) (clear d9) (cellspace celln3)
   added: (incell d9) (clear s10) (cellspace celln2)
   goals met: 1 of 4
66. (sendtofree d8 s9 celln2 celln1)
   deleted: (on d8 s9) (clear d8) (cellspace celln2)
   added: (incell d8) (clear s9) (cellspace celln1)
   goals met: 1 of 4
67. (sendtohome-b s9 s n9 s8 n8 coln5 coln6)
   deleted: (home s8) (clear s9) (bottomcol s9) (colspace coln5)
   added: (home s9) (colspace coln6)
   goals met: 1 of 4
68. (sendtohome s10 c10 s n10 s9 n9)
   deleted: (on s10 c10) (home s9) (clear s10)
   added: (home s10) (clear c10)
   goals met: 2 of 4
69. (sendtohome c10 d6 c n10 c9 n9)
   deleted: (on c10 d6) (home c9) (clear c10)
   added: (home c10) (clear d6)
   goals met: 3 of 4
70. (sendtohome-b d6 d n6 d5 n5 coln6 coln7)
   deleted: (home d5) (clear d6) (bottomcol d6) (colspace coln6)
   added: (home d6) (colspace coln7)
   goals met: 3 of 4
71. (sendtohome-b d7 d n7 d6 n6 coln7 coln8)
   deleted: (home d6) (clear d7) (bottomcol d7) (colspace coln7)
   added: (home d7) (colspace coln8)
   goals met: 3 of 4
72. (homefromfreecell d8 d n8 d7 n7 celln1 celln2)
   deleted: (incell d8) (cellspace celln1) (home d7)
   added: (home d8) (cellspace celln2)
   goals met: 3 of 4
73. (homefromfreecell d9 d n9 d8 n8 celln2 celln3)
   deleted: (incell d9) (cellspace celln2) (home d8)
   added: (home d9) (cellspace celln3)
   goals met: 3 of 4
74. (homefromfreecell d10 d n10 d9 n9 celln3 celln4)
   deleted: (incell d10) (cellspace celln3) (home d9)
   added: (home d10) (cellspace celln4)
   goals met: 4 of 4
